###### Creating Connection and Cursor Objects

In [14]:
def helper():
  import sqlite3
  con = sqlite3.connect("titanic.db")
  curs = con.cursor()
  curs.execute('''DROP TABLE IF EXISTS new_table''')

In [15]:
helper()
import sqlite3

con = sqlite3.connect("titanic.db")
curs = con.cursor()

OperationalError: database is locked

In [16]:
# Create table named new_table
curs.execute('''CREATE TABLE titanic (         
                    name TEXT,
                    age INTEGER,
                    username TEXT,
                    pay_rate REAL)''')
# Insert row of values into new_table
curs.execute('''INSERT INTO titanic VALUES ('Bob Peterson', 34, 'bob1234', 40.00)''')

In [17]:
# Here is the new_rows object
new_rows = [('Anne Smith', 33, 'AS896', 25.00),
            ('Billy Roberts', 29, 'bill5Rob', 30.00),
            ('Jason Johnson', 48, 'JasonJ77', 40.00),
            ('Tim Trunk', 51, 'Timtrunk4', 40.00),
            ('Sarah Fall',19, 'SFall232', 25.00)
            ]

# Insert new_rows into the new_table table
curs.executemany('''INSERT INTO titanic VALUES (?,?,?,?)''', new_rows)

In [19]:
# Pull the first row from the titanice data table (print to view output)
one = curs.execute("SELECT * FROM titanic ").fetchone()
print(one)

# Pull the first ten rows from the titanice data table (print to view output)
ten  = curs.execute("SELECT * FROM titanic ").fetchmany(10)
print(ten)

('Bob Peterson', 34, 'bob1234', 40.0)
[('Bob Peterson', 34, 'bob1234', 40.0), ('Anne Smith', 33, 'AS896', 25.0), ('Billy Roberts', 29, 'bill5Rob', 30.0), ('Jason Johnson', 48, 'JasonJ77', 40.0), ('Tim Trunk', 51, 'Timtrunk4', 40.0), ('Sarah Fall', 19, 'SFall232', 25.0)]

In [20]:
# Pull every row from the titanice data table (print to view output)
all_rows  = curs.execute("SELECT * FROM titanic").fetchall()
print(all_rows)

[('Bob Peterson', 34, 'bob1234', 40.0), ('Anne Smith', 33, 'AS896', 25.0), ('Billy Roberts', 29, 'bill5Rob', 30.0), ('Jason Johnson', 48, 'JasonJ77', 40.0), ('Tim Trunk', 51, 'Timtrunk4', 40.0), ('Sarah Fall', 19, 'SFall232', 25.0)]

In [21]:
# Pull every row from the titanice data table for those who survived (print to view output)
all_survived = curs.execute('''SELECT * FROM titanic WHERE Survived = 1 ;''').fetchall()

OperationalError: no such column: Survived

In [22]:
import sqlite3

con = sqlite3.connect("titanic.db")
curs = con.cursor()

# Pull the Age records from the titanic table using .fetchall() method and save as age
age = curs.execute("SELECT Age FROM titanic;").fetchall()

# Create a for loop that calculates the number of children
sum = 0
for num in age: 
  if num[0] < 18:
    sum = sum + 1
            
print(sum)

OperationalError: no such table: titanic

###### Add row

In [ ]:
def helper():
  import sqlite3
  con = sqlite3.connect("titanic.db")
  curs = con.cursor()
  if curs.execute('''SELECT * FROM new_table WHERE Age = 33;''').fetchall() == [('Anne Smith', 33, 'AS896', 25.0)]:
    curs.execute('''DELETE FROM new_table WHERE Age = 37;''')
    con.commit()
    con.close()

In [ ]:
from start import helper
helper()
import sqlite3

con = sqlite3.connect("titanic.db")
curs = con.cursor()

# insert a row in new_table table
curs.execute('''INSERT INTO new_table VALUES ('Stephanie Bready', 37, 'stephB423', 30.00)''')
# commit this change
con.commit()

# close the connection
con.close()

###### test

In [23]:
# Import module sqlite3
import sqlite3
# Create connection object
con = sqlite3.connect('titanic.db')
# Create cursor object
curs = con.cursor()
# Retrieve the row where username = 'stephB423'; from new_table
n_row = all_survived = curs.execute('''SELECT * FROM new_table WHERE username = 'stephB423';''').fetchone()
# Close the connection
con.close()